Tekla Open API Reference for Tekla Structures 2025
Color Constructor
 Creates a new color object. The default object is black.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Color()
Public Sub New
See Also
Reference
Color Class
Color Overload
Tekla.Structures.Model.UI Namespace